nxp-mcuxpresso/mcux-sdk/devices/MK28FA15/drivers/fsl_clock.h
              kClockGateSdhc0 = (0x1030 << 16) | 17;

------------------------------------------------------------------------------*/

#define CLK_GATE_REG_OFFSET_SHIFT 16U
#define CLK_GATE_REG_OFFSET_MASK 0xFFFF0000U
#define CLK_GATE_BIT_SHIFT_SHIFT 0U
#define CLK_GATE_BIT_SHIFT_MASK 0x0000FFFFU

#define CLK_GATE_DEFINE(reg_offset, bit_shift)                                  \
    ((((reg_offset) << CLK_GATE_REG_OFFSET_SHIFT) & CLK_GATE_REG_OFFSET_MASK) | \
     (((bit_shift) << CLK_GATE_BIT_SHIFT_SHIFT) & CLK_GATE_BIT_SHIFT_MASK))

#define CLK_GATE_ABSTRACT_REG_OFFSET(x) (((x)&CLK_GATE_REG_OFFSET_MASK) >> CLK_GATE_REG_OFFSET_SHIFT)
#define CLK_GATE_ABSTRACT_BITS_SHIFT(x) (((x)&CLK_GATE_BIT_SHIFT_MASK) >> CLK_GATE_BIT_SHIFT_SHIFT)

/*! @brief Clock gate name used for CLOCK_EnableClock/CLOCK_DisableClock. */
typedef enum _clock_ip_name
{
    kCLOCK_IpInvalid = 0U,
    kCLOCK_I2c2      = CLK_GATE_DEFINE(0x1028U, 6U),
    kCLOCK_I2c3      = CLK_GATE_DEFINE(0x1028U, 7U),

    kCLOCK_Lpuart0 = CLK_GATE_DEFINE(0x102CU, 4U),
    kCLOCK_Lpuart1 = CLK_GATE_DEFINE(0x102CU, 5U),
    kCLOCK_Lpuart2 = CLK_GATE_DEFINE(0x102CU, 6U),
    kCLOCK_Lpuart3 = CLK_GATE_DEFINE(0x102CU, 7U),
    kCLOCK_Tpm1    = CLK_GATE_DEFINE(0x102CU, 9U),
    kCLOCK_Tpm2    = CLK_GATE_DEFINE(0x102CU, 10U),
    kCLOCK_Dac0    = CLK_GATE_DEFINE(0x102CU, 12U),
    kCLOCK_Lpuart4 = CLK_GATE_DEFINE(0x102CU, 22U),
    kCLOCK_Qspi0   = CLK_GATE_DEFINE(0x102CU, 26U),
    kCLOCK_Flexio0 = CLK_GATE_DEFINE(0x102CU, 31U),

    kCLOCK_Trng0    = CLK_GATE_DEFINE(0x1030U, 0U),
    kCLOCK_Usbhs    = CLK_GATE_DEFINE(0x1030U, 1U),
    kCLOCK_Usbhsphy = CLK_GATE_DEFINE(0x1030U, 2U),
    kCLOCK_Usbhsdcd = CLK_GATE_DEFINE(0x1030U, 3U),
    kCLOCK_Spi2     = CLK_GATE_DEFINE(0x1030U, 12U),
    kCLOCK_Spi3     = CLK_GATE_DEFINE(0x1030U, 13U),
    kCLOCK_Sai1     = CLK_GATE_DEFINE(0x1030U, 15U),
    kCLOCK_Sdhc0    = CLK_GATE_DEFINE(0x1030U, 17U),
    kCLOCK_Ftm2     = CLK_GATE_DEFINE(0x1030U, 24U),
    kCLOCK_Ftm3     = CLK_GATE_DEFINE(0x1030U, 25U),

    kCLOCK_Ewm0   = CLK_GATE_DEFINE(0x1034U, 1U),
    kCLOCK_Cmt0   = CLK_GATE_DEFINE(0x1034U, 2U),
    kCLOCK_I2c0   = CLK_GATE_DEFINE(0x1034U, 6U),
    kCLOCK_I2c1   = CLK_GATE_DEFINE(0x1034U, 7U),
    kCLOCK_Usbfs0 = CLK_GATE_DEFINE(0x1034U, 18U),
    kCLOCK_Cmp0   = CLK_GATE_DEFINE(0x1034U, 19U),
    kCLOCK_Cmp1   = CLK_GATE_DEFINE(0x1034U, 19U),
    kCLOCK_Vref0  = CLK_GATE_DEFINE(0x1034U, 20U),

    kCLOCK_Lptmr0 = CLK_GATE_DEFINE(0x1038U, 0U),
    kCLOCK_Lptmr1 = CLK_GATE_DEFINE(0x1038U, 4U),
    kCLOCK_Tsi0   = CLK_GATE_DEFINE(0x1038U, 5U),
    kCLOCK_PortA  = CLK_GATE_DEFINE(0x1038U, 9U),
    kCLOCK_PortB  = CLK_GATE_DEFINE(0x1038U, 10U),
    kCLOCK_PortC  = CLK_GATE_DEFINE(0x1038U, 11U),
    kCLOCK_PortD  = CLK_GATE_DEFINE(0x1038U, 12U),
    kCLOCK_PortE  = CLK_GATE_DEFINE(0x1038U, 13U),

    kCLOCK_Ftf0    = CLK_GATE_DEFINE(0x103CU, 0U),
    kCLOCK_Dmamux0 = CLK_GATE_DEFINE(0x103CU, 1U),
    kCLOCK_Spi0    = CLK_GATE_DEFINE(0x103CU, 12U),
    kCLOCK_Spi1    = CLK_GATE_DEFINE(0x103CU, 13U),
    kCLOCK_Sai0    = CLK_GATE_DEFINE(0x103CU, 15U),
    kCLOCK_Crc0    = CLK_GATE_DEFINE(0x103CU, 18U),
    kCLOCK_Usbdcd0 = CLK_GATE_DEFINE(0x103CU, 21U),
    kCLOCK_Pdb0    = CLK_GATE_DEFINE(0x103CU, 22U),
    kCLOCK_Pit0    = CLK_GATE_DEFINE(0x103CU, 23U),
    kCLOCK_Ftm0    = CLK_GATE_DEFINE(0x103CU, 24U),
    kCLOCK_Ftm1    = CLK_GATE_DEFINE(0x103CU, 25U),
    kCLOCK_Adc0    = CLK_GATE_DEFINE(0x103CU, 27U),
    kCLOCK_Rtc0    = CLK_GATE_DEFINE(0x103CU, 29U),

    kCLOCK_Flexbus0 = CLK_GATE_DEFINE(0x1040U, 0U),
    kCLOCK_Dma0     = CLK_GATE_DEFINE(0x1040U, 1U),
    kCLOCK_Sysmpu0  = CLK_GATE_DEFINE(0x1040U, 2U),
    kCLOCK_Sdramc0  = CLK_GATE_DEFINE(0x1040U, 3U),
} clock_ip_name_t;

/*! @brief Source of the USB HS PHY. */
typedef enum _clock_usb_phy_src
{
    kCLOCK_UsbPhySrcExt = 0U, /*!< Use external crystal. */
} clock_usb_phy_src_t;

/*! @brief Source of the USB HS PFD clock (USB1PFDCLK) */
typedef enum _clock_usb_pfd_src
{
    kCLOCK_UsbPfdSrcExt        = 0U, /*!< Use external crystal. */
    kCLOCK_UsbPfdSrcFracDivBy4 = 1U, /*!< Use PFD_FRAC output divided by 4. */
    kCLOCK_UsbPfdSrcFracDivBy2 = 2U, /*!< Use PFD_FRAC output divided by 2. */
    kCLOCK_UsbPfdSrcFrac       = 3U, /*!< Use PFD_FRAC output. */
} clock_usb_pfd_src_t;

/*!@brief SIM configuration structure for clock setting. */
typedef struct _sim_clock_config
{
    uint8_t pllFllSel;  /*!< PLL/FLL/IRC48M selection.         */
    uint8_t pllFllDiv;  /*!< PLLFLLSEL clock divider divisor.  */
    uint8_t pllFllFrac; /*!< PLLFLLSEL clock divider fraction. */
    uint8_t er32kSrc;   /*!< ERCLK32K source selection.        */
    uint32_t clkdiv1;   /*!< SIM_CLKDIV1.                      */
} sim_clock_config_t;

/*! @brief OSC work mode. */
typedef enum _osc_mode
{
    kOSC_ModeExt = 0U, /*!< Use an external clock.   */
#if (defined(MCG_C2_EREFS_MASK) && !(defined(MCG_C2_EREFS0_MASK)))
    kOSC_ModeOscLowPower = MCG_C2_EREFS_MASK, /*!< Oscillator low power. */
#else
    kOSC_ModeOscLowPower = MCG_C2_EREFS0_MASK, /*!< Oscillator low power. */
#endif
    kOSC_ModeOscHighGain = 0U
#if (defined(MCG_C2_EREFS_MASK) && !(defined(MCG_C2_EREFS0_MASK)))
                           | MCG_C2_EREFS_MASK
#else
                           | MCG_C2_EREFS0_MASK
#endif
#if (defined(MCG_C2_HGO_MASK) && !(defined(MCG_C2_HGO0_MASK)))
                           | MCG_C2_HGO_MASK, /*!< Oscillator high gain. */
#else
                           | MCG_C2_HGO0_MASK, /*!< Oscillator high gain. */
#endif
} osc_mode_t;

/*! @brief Oscillator capacitor load setting.*/
enum _osc_cap_load
{
    kOSC_Cap2P  = OSC_CR_SC2P_MASK, /*!< 2  pF capacitor load */
    kOSC_Cap4P  = OSC_CR_SC4P_MASK, /*!< 4  pF capacitor load */
    kOSC_Cap8P  = OSC_CR_SC8P_MASK, /*!< 8  pF capacitor load */
    kOSC_Cap16P = OSC_CR_SC16P_MASK /*!< 16 pF capacitor load */
};

/*! @brief OSCERCLK enable mode. */
enum _oscer_enable_mode
{
    kOSC_ErClkEnable       = OSC_CR_ERCLKEN_MASK, /*!< Enable.              */
    kOSC_ErClkEnableInStop = OSC_CR_EREFSTEN_MASK /*!< Enable in stop mode. */
};

